#+TITLE: Yang's Emacs Configurations

I use [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][Literate Programming]] to mix up my configuration code and the
explanatory comments so that I can easily pick the meaning of a piece
of code after a long time.

The most of the code base comes from [[https://github.com/purcell/emacs.d][Steve Purcell's emacs.d]] and what
I'm gonna do is to translate them in a literate programming
way. (P.S. It was refered in [[https://github.com/redguardtoo/mastering-emacs-in-one-year-guide/blob/master/guide-zh.org][Mastering Emacs in One Year Guide]])

The init.el is learnt from [[http://pages.sachachua.com/.emacs.d/Sacha.html][Sacha Chua's config]] and the official [[http://orgmode.org/worg/org-contrib/babel/intro.html#literate-programming][babel
guide]]. With this I can auto load my org file into initialization
progress.

The Org-mode config comes from [[http://doc.norang.ca/org-mode.html][here]].

I use the digit number to indicate the execute order the all the org
files.  Currently there are 3 levels:

  - =0-xxx.org=: personal variables setting
  - =1-sys.org=: all the universal package configs
  - =2-xyz.org=: settings for major mode =xyz=

#+header: :tangle yes
#+BEGIN_SRC emacs-lisp
;; placeholder for init.el tangle handler
#+END_SRC

The current progress of translating Steve Purcell's config is:
** TODO [[http://pages.sachachua.com/.emacs.d/Sacha.html][Literate Programming Emacs Configuration]] [2/10]        :@network:ORG:
    :LOGBOOK:
    CLOCK: [2015-04-30 Thu 22:08]--[2015-04-30 Thu 22:09] =>  0:01
    CLOCK: [2015-04-30 Thu 22:07]--[2015-04-30 Thu 22:08] =>  0:01
    CLOCK: [2015-04-27 Mon 16:02]--[2015-04-27 Mon 16:04] =>  0:02
    CLOCK: [2015-04-27 Mon 14:55]--[2015-04-27 Mon 15:54] =>  0:59
    CLOCK: [2015-04-27 Mon 14:49]--[2015-04-27 Mon 14:53] =>  0:04
    CLOCK: [2015-04-27 Mon 14:37]--[2015-04-27 Mon 14:46] =>  0:09
    CLOCK: [2015-04-27 Mon 14:01]--[2015-04-27 Mon 14:02] =>  0:01
    :END:
  [2015-04-27 Mon 14:01]
  - [X] personal info
**** DONE Bootstrap config [4/4]
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     :LOGBOOK:
     CLOCK: [2015-04-27 Mon 16:04]--[2015-04-27 Mon 16:47] =>  0:43
     :END:
     - [X] compatibility issues - compat
     - [X] helper functions - utils
     - [X] package manager - elpa
     - [X] set up $PATH; for Windows Emacs - exec-path
**** HOLD base packages [1/4]					       :HOLD:
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     - State "HOLD"       from "NEXT"       [2015-04-28 Tue 21:14] \\
       Some of these packages I don't think I ll use them currently.
       So I ll just leave it.
     :LOGBOOK:
     CLOCK: [2015-04-28 Tue 21:10]--[2015-04-28 Tue 21:15] =>  0:05
     :END:
     - [ ] write grep command in a buffer - wgrep
     - [ ] minor mode with no modeline display - dimnish
     - [X] mode-specific scratch buffers - scratch
     - [ ] log keyboard commands to buffer - mwe-log-commands
**** WAITING Load config for specific features & modes [3/25] 	    :WAITING:
     :PROPERTIES:
     :END:
     - State "WAITING"    from "NEXT"       [2015-04-30 Thu 23:57] \\
       wait for navigation
     :PROPERTIES:
    
    :END:
     :LOGBOOK:
     CLOCK: [2015-04-28 Tue 21:40]--[2015-04-28 Tue 22:24] =>  0:44
     CLOCK: [2015-04-28 Tue 21:16]--[2015-04-28 Tue 21:28] =>  0:12
     :END:
     - [ ] frame-hooks - a hook runs after a newly created frame
     - xtrem - I don't use xterm now
     - [X] *themes*
     - osx-keys - I've set the key binding system wide, so no need for this
     - [X] gui-frames
     - [ ] fonts
     - [ ] evil --- should I install it?
       - [ ] FIXME: powerline
       - [ ] use c-p c-n in insert mode
     - [ ] relative-line-numbers - obsolete - mode specific
     - [ ] proxies - obsolete
     - [ ] dired
     - [ ] speedbar
     - [ ] isearch
     - [ ] grep
     - [ ] uniquify
     - [ ] ibuffer
     - [X] *flycheck*
     - [ ] recentf
     - [ ] ido
     - [ ] mmm
     - [ ] crontab
     - [ ] spelling
     - [ ] *misc*
     - [ ] ledger - obsolete
     - [ ] gnuplot - obsolete
     - [ ] osx-location
     - [ ] regex-tool
     - [ ] server
**** NEXT Text edit [0/5]
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     - [ ] hippie-expand
     - [ ] editing-utils
     - [ ] *company*
     - [ ] *yasnippet*
     - [ ] *doxymacs*
**** DONE Navigation & Projects Management - bookmark+ now [6/6]
     :LOGBOOK:
     CLOCK: [2015-04-30 Thu 14:21]--[2015-04-30 Thu 14:50] =>  0:29
     CLOCK: [2015-04-30 Thu 11:02]--[2015-04-30 Thu 11:37] =>  0:35
     CLOCK: [2015-04-30 Thu 10:22]--[2015-04-30 Thu 10:47] =>  0:25
     CLOCK: [2015-04-30 Thu 09:32]--[2015-04-30 Thu 10:15] =>  0:43
     CLOCK: [2015-04-30 Thu 09:12]--[2015-04-30 Thu 09:24] =>  0:12
     CLOCK: [2015-04-29 Wed 21:23]--[2015-04-29 Wed 22:00] =>  0:37
     CLOCK: [2015-04-29 Wed 20:50]--[2015-04-29 Wed 21:22] =>  0:32
     CLOCK: [2015-04-29 Wed 18:32]--[2015-04-29 Wed 20:02] =>  1:30
     CLOCK: [2015-04-29 Wed 14:57]--[2015-04-29 Wed 16:11] =>  1:14
     CLOCK: [2015-04-29 Wed 14:54]--[2015-04-29 Wed 14:57] =>  0:03
     CLOCK: [2015-04-29 Wed 11:52]--[2015-04-29 Wed 12:13] =>  0:21
     CLOCK: [2015-04-29 Wed 11:00]--[2015-04-29 Wed 11:51] =>  0:51
     CLOCK: [2015-04-28 Tue 22:55]--[2015-04-28 Tue 23:34] =>  0:39
     CLOCK: [2015-04-28 Tue 22:24]--[2015-04-28 Tue 22:34] =>  0:10
     :END:
***** DONE *helm* [6/6]

      - State "WAITING"    from "NEXT"       [2015-04-30 Thu 23:55] \\
	Waiting for bookmark+
****** DONE FIXME: helm org tags
****** DONE *helm-projectile*
       :LOGBOOK:
       CLOCK: [2015-07-07 Tue 11:03]--[2015-07-07 Tue 11:04] =>  0:01
       :END:
******* DONE use bookmark+ to store virtual dired buffer
	:LOGBOOK:
	CLOCK: [2015-07-07 Tue 11:04]--[2015-07-07 Tue 11:31] =>  0:27
	CLOCK: [2015-07-07 Tue 10:31]--[2015-07-07 Tue 11:03] =>  0:32
	CLOCK: [2015-07-07 Tue 08:51]--[2015-07-07 Tue 10:22] =>  1:31
	:END:
****** DONE eshell-history
       :LOGBOOK:
       CLOCK: [2015-07-09 Thu 10:49]--[2015-07-09 Thu 10:55] =>  0:06
       :END:
****** DONE descbinds
       :LOGBOOK:
       CLOCK: [2015-07-09 Thu 11:04]--[2015-07-09 Thu 11:05] =>  0:01
       CLOCK: [2015-07-09 Thu 10:55]--[2015-07-09 Thu 11:01] =>  0:06
       :END:
****** DONE helm-gtags
       :LOGBOOK:
       CLOCK: [2015-07-09 Thu 11:06]--[2015-07-09 Thu 11:08] =>  0:02
       :END:

****** DONE IDO or helm?
       :PROPERTIES:
       :Effort:   2:00
       :END:
	:LOGBOOK:
	CLOCK: [2015-04-29 Wed 10:34]--[2015-04-29 Wed 10:42] =>  0:08
	:END:
      [2015-04-29 Wed 01:01]
***** DONE *projectile*
***** DONE *bookmark*
      :LOGBOOK:
      CLOCK: [2015-05-03 Sun 09:44]--[2015-05-03 Sun 09:45] =>  0:01
      CLOCK: [2015-05-03 Sun 09:36]--[2015-05-03 Sun 09:43] =>  0:07
      :END:
***** [[https://github.com/nex3/perspective-el][perspective]] - I think I will not need it
***** windows - should I install? - obsolete
***** DONE sessions
***** vc - obsolete
***** darcs - obsolete
***** DONE *git*
      :LOGBOOK:
      CLOCK: [2015-07-09 Thu 11:25]--[2015-07-09 Thu 11:52] =>  0:27
      CLOCK: [2015-07-09 Thu 11:11]--[2015-07-09 Thu 11:25] =>  0:14
      :END:
***** DONE *github*
      :LOGBOOK:
      CLOCK: [2015-07-09 Thu 11:53]--[2015-07-09 Thu 11:57] =>  0:04
      :END:
**** TODO Sematics & Language Support [1/17]
     :PROPERTIES:
     :END:
     :LOGBOOK:
     CLOCK: [2015-07-02 Thu 15:51]--[2015-07-02 Thu 17:00] =>  1:09
     :END:
    :PROPERTIES:
    
    :END:
     - [ ] semantic - should I install?
     - [ ] compile
     - [ ] cc
     - [ ] textile
     - [ ] markdown
     - [ ] csv
     - [ ] erlang
     - [ ] python - remember ipython notebooks
     - [X] haskell
     - [ ] ruby
     - [ ] rails
     - [ ] R
     - [ ] paredit
     - [ ] lisp
     - [ ] slime
     - [ ] clojure
     - [ ] lua
**** TODO Front-end languages [0/11]
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     - [ ] javascript
     - [ ] php
     - [ ] org
     - [ ] latex
     - [ ] nxml
     - [ ] html
     - [ ] htmlize
     - [ ] css
     - [ ] haml
     - [ ] sql
     - [ ] dsvn
**** TODO Documentation [0/1]
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     - [ ] dash
**** TODO Misc [0/3]
     :PROPERTIES:
     :END:
    :PROPERTIES:
    
    :END:
     :LOGBOOK:
     CLOCK: [2015-04-29 Wed 11:07]--[2015-04-29 Wed 11:08] =>  0:01
     CLOCK: [2015-04-29 Wed 10:42]--[2015-04-29 Wed 10:45] =>  0:03
     :END:
     - [ ] variables configured via the interactive 'customize' interface
     - [ ] allow users to provide optional 'init-local' containting personal settings
     - [ ] locales (setting them earlier in this file doesn't work in X)
**** NEXT [[file:~/.emacs.d][git push .emacs.d]]			:Git:
     SCHEDULED: <2015-07-10 Fri .+1d/7d>
     :PROPERTIES:
     :STYLE:    habit
     :REPEAT_TO_STATE: NEXT
     :LAST_REPEAT: [2015-07-09 Thu 10:48]
     :END:
     - State "DONE"       from "NEXT"       [2015-07-09 Thu 10:48]
     - State "DONE"       from "NEXT"       [2015-07-03 Fri 17:10]
     - State "DONE"       from "NEXT"       [2015-06-17 Wed 20:05]
     - State "DONE"       from "NEXT"       [2015-04-29 Wed 23:42]
     :LOGBOOK:
     CLOCK: [2015-07-03 Fri 16:58]--[2015-07-03 Fri 17:10] =>  0:12
     CLOCK: [2015-06-17 Wed 19:59]--[2015-06-17 Wed 20:05] =>  0:06
     CLOCK: [2015-04-29 Wed 23:26]--[2015-04-29 Wed 23:42] =>  0:16
     :END:
   [2015-04-29 Wed 23:21]
